mikeakohn/naken_asm/include/8051/stc8hxx.inc
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; STC8Hxx include
;; part of the naken_asm assembler
;;
;; Generated by: Cjacker Huang (cjacker@gmail.com)
;;         Date: 2022-05-21
;;        Parts: STC8Hxx
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

S4CON equ 0x84
S4BUF equ 0x85
INTCLKO equ 0x8f
P1M1 equ 0x91
P1M0 equ 0x92
P0M1 equ 0x93
P0M0 equ 0x94
P2M1 equ 0x95
P2M0 equ 0x96
S2CON equ 0x9a
S2BUF equ 0x9b
IRCBAND equ 0x9d
LIRTRIM equ 0x9e
IRTRIM equ 0x9f
P_SW1 equ 0xa2
SADDR equ 0xa9
WKTCL equ 0xaa
WKTCH equ 0xab
S3CON equ 0xac
S3BUF equ 0xad
TA equ 0xae
IE2 equ 0xaf
P3M1 equ 0xb1
P3M0 equ 0xb2
P4M1 equ 0xb3
P4M0 equ 0xb4
IP2 equ 0xb5
IP2H equ 0xb6
IPH equ 0xb7
SADEN equ 0xb9
P_SW2 equ 0xba
ADC_CONTR equ 0xbc
ADC_RES equ 0xbd
ADC_RESL equ 0xbe
WDT_CONTR equ 0xc1
IAP_DATA equ 0xc2
IAP_ADDRH equ 0xc3
IAP_ADDRL equ 0xc4
IAP_CMD equ 0xc5
IAP_TRIG equ 0xc6
IAP_CONTR equ 0xc7
P5M1 equ 0xc9
P5M0 equ 0xca
P6M1 equ 0xcb
P6M0 equ 0xcc
SPSTAT equ 0xcd
SPCTL equ 0xce
SPDAT equ 0xcf
T4T3M equ 0xd1
T4H equ 0xd2
T4L equ 0xd3
T3H equ 0xd4
T3L equ 0xd5
T2H equ 0xd6
T2L equ 0xd7
USBCLK equ 0xdc
ADCCFG equ 0xde
IP3 equ 0xdf
P7M1 equ 0xe1
P7M0 equ 0xe2
DPS equ 0xe3
DPL1 equ 0xe4
DPH1 equ 0xe5
CMPCR1 equ 0xe6
CMPCR2 equ 0xe7
USBDAT equ 0xec
IP3H equ 0xee
AUXINTIF equ 0xef
USBCON equ 0xf4
IAP_TPS equ 0xf5
USBADR equ 0xfc
RSTCFG equ 0xff

; xdata

CKSEL equ 0xfe00
CLKDIV equ 0xfe01
HIRCCR equ 0xfe02
XOSCCR equ 0xfe03
IRC32KCR equ 0xfe04
MCLKOCR equ 0xfe05
IRCDB equ 0xfe06
X32KCR equ 0xfe08
P0PU equ 0xfe10
P1PU equ 0xfe11
P2PU equ 0xfe12
P3PU equ 0xfe13
P4PU equ 0xfe14
P5PU equ 0xfe15
P6PU equ 0xfe16
P7PU equ 0xfe17
P0NCS equ 0xfe18
P1NCS equ 0xfe19
P2NCS equ 0xfe1a
P3NCS equ 0xfe1b
P4NCS equ 0xfe1c
P5NCS equ 0xfe1d
P6NCS equ 0xfe1e
P7NCS equ 0xfe1f
P0SR equ 0xfe20
P1SR equ 0xfe21
P2SR equ 0xfe22
P3SR equ 0xfe23
P4SR equ 0xfe24
P5SR equ 0xfe25
P6SR equ 0xfe26
P7SR equ 0xfe27
P0DR equ 0xfe28
P1DR equ 0xfe29
P2DR equ 0xfe2a
P3DR equ 0xfe2b
P4DR equ 0xfe2c
P5DR equ 0xfe2d
P6DR equ 0xfe2e
P7DR equ 0xfe2f
P0IE equ 0xfe30
P1IE equ 0xfe31
P2IE equ 0xfe32
P3IE equ 0xfe33
P4IE equ 0xfe34
P5IE equ 0xfe35
P6IE equ 0xfe36
P7IE equ 0xfe37
RTCCR equ 0xfe60
RTCCFG equ 0xfe61
RTCIEN equ 0xfe62
RTCIF equ 0xfe63
ALAHOUR equ 0xfe64
ALAMIN equ 0xfe65
ALASEC equ 0xfe66
ALASSEC equ 0xfe67
INIYEAR equ 0xfe68
INIMONTH equ 0xfe69
INIDAY equ 0xfe6a
INIHOUR equ 0xfe6b
INIMIN equ 0xfe6c
INISEC equ 0xfe6d
INISSEC equ 0xfe6e
YEAR equ 0xfe70
MONTH equ 0xfe71
DAY equ 0xfe72
HOUR equ 0xfe73
MIN equ 0xfe74
SEC equ 0xfe75
SSEC equ 0xfe76
I2CCFG equ 0xfe80
I2CMSCR equ 0xfe81
I2CMSST equ 0xfe82
I2CSLCR equ 0xfe83
I2CSLST equ 0xfe84
I2CSLADR equ 0xfe85
I2CTXD equ 0xfe86
I2CRXD equ 0xfe87
I2CMSAUX equ 0xfe88
TM2PS equ 0xfea2
TM3PS equ 0xfea3
TM4PS equ 0xfea4
ADCTIM equ 0xfea8
T3T4PIN equ 0xfeac
PWM1_ETRPS equ 0xfeb0
PWM1_ENO equ 0xfeb1
PWM1_PS equ 0xfeb2
PWM1_IOAUX equ 0xfeb3
PWM2_ETRPS equ 0xfeb4
PWM2_ENO equ 0xfeb5
PWM2_PS equ 0xfeb6
PWM2_IOAUX equ 0xfeb7
PWM1_CR1 equ 0xfec0
PWM1_CR2 equ 0xfec1
PWM1_SMCR equ 0xfec2
PWM1_ETR equ 0xfec3
PWM1_IER equ 0xfec4
PWM1_SR1 equ 0xfec5
PWM1_SR2 equ 0xfec6
PWM1_EGR equ 0xfec7
PWM1_CCMR1 equ 0xfec8
PWM1_CCMR2 equ 0xfec9
PWM1_CCMR3 equ 0xfeca
PWM1_CCMR4 equ 0xfecb
PWM1_CCER1 equ 0xfecc
PWM1_CCER2 equ 0xfecd
PWM1_CNTR equ 0xfece
PWM1_CNTRH equ 0xfece
PWM1_CNTRL equ 0xfecf
PWM1_PSCR equ 0xfed0
PWM1_PSCRH equ 0xfed0
PWM1_PSCRL equ 0xfed1
PWM1_ARR equ 0xfed2
PWM1_ARRH equ 0xfed2
PWM1_ARRL equ 0xfed3
PWM1_RCR equ 0xfed4
PWM1_CCR1 equ 0xfed5
PWM1_CCR1H equ 0xfed5
PWM1_CCR1L equ 0xfed6
PWM1_CCR2 equ 0xfed7
PWM1_CCR2H equ 0xfed7
PWM1_CCR2L equ 0xfed8
PWM1_CCR3 equ 0xfed9
PWM1_CCR3H equ 0xfed9
PWM1_CCR3L equ 0xfeda
PWM1_CCR4 equ 0xfedb
PWM1_CCR4H equ 0xfedb
PWM1_CCR4L equ 0xfedc
PWM1_BKR equ 0xfedd
PWM1_DTR equ 0xfede
PWM1_OISR equ 0xfedf
PWM2_CR1 equ 0xfee0
PWM2_CR2 equ 0xfee1
PWM2_SMCR equ 0xfee2
PWM2_ETR equ 0xfee3
PWM2_IER equ 0xfee4
PWM2_SR1 equ 0xfee5
PWM2_SR2 equ 0xfee6
PWM2_EGR equ 0xfee7
PWM2_CCMR1 equ 0xfee8
PWM2_CCMR2 equ 0xfee9
PWM2_CCMR3 equ 0xfeea
PWM2_CCMR4 equ 0xfeeb
PWM2_CCER1 equ 0xfeec
PWM2_CCER2 equ 0xfeed
PWM2_CNTR equ 0xfeee
PWM2_CNTRH equ 0xfeee
PWM2_CNTRL equ 0xfeef
PWM2_PSCR equ 0xfef0
PWM2_PSCRH equ 0xfef0
PWM2_PSCRL equ 0xfef1
PWM2_ARR equ 0xfef2
PWM2_ARRH equ 0xfef2
PWM2_ARRL equ 0xfef3
PWM2_RCR equ 0xfef4
PWM2_CCR1 equ 0xfef5
PWM2_CCR1H equ 0xfef5
PWM2_CCR1L equ 0xfef6
PWM2_CCR2 equ 0xfef7
PWM2_CCR2H equ 0xfef7
PWM2_CCR2L equ 0xfef8
PWM2_CCR3 equ 0xfef9
PWM2_CCR3H equ 0xfef9
PWM2_CCR3L equ 0xfefa
PWM2_CCR4 equ 0xfefb
PWM2_CCR4H equ 0xfefb
PWM2_CCR4L equ 0xfefc
PWM2_BKR equ 0xfefd
PWM2_DTR equ 0xfefe
PWM2_OISR equ 0xfeff
PWMA_ETRPS equ 0xfeb0
PWMA_ENO equ 0xfeb1
PWMA_PS equ 0xfeb2
PWMA_IOAUX equ 0xfeb3
PWMB_ETRPS equ 0xfeb4
PWMB_ENO equ 0xfeb5
PWMB_PS equ 0xfeb6
PWMB_IOAUX equ 0xfeb7
PWMA_CR1 equ 0xfec0
PWMA_CR2 equ 0xfec1
PWMA_SMCR equ 0xfec2
PWMA_ETR equ 0xfec3
PWMA_IER equ 0xfec4
PWMA_SR1 equ 0xfec5
PWMA_SR2 equ 0xfec6
PWMA_EGR equ 0xfec7
PWMA_CCMR1 equ 0xfec8
PWMA_CCMR2 equ 0xfec9
PWMA_CCMR3 equ 0xfeca
PWMA_CCMR4 equ 0xfecb
PWMA_CCER1 equ 0xfecc
PWMA_CCER2 equ 0xfecd
PWMA_CNTR equ 0xfece
PWMA_CNTRH equ 0xfece
PWMA_CNTRL equ 0xfecf
PWMA_PSCR equ 0xfed0
PWMA_PSCRH equ 0xfed0
PWMA_PSCRL equ 0xfed1
PWMA_ARR equ 0xfed2
PWMA_ARRH equ 0xfed2
PWMA_ARRL equ 0xfed3
PWMA_RCR equ 0xfed4
PWMA_CCR1 equ 0xfed5
PWMA_CCR1H equ 0xfed5
PWMA_CCR1L equ 0xfed6
PWMA_CCR2 equ 0xfed7
PWMA_CCR2H equ 0xfed7
PWMA_CCR2L equ 0xfed8
PWMA_CCR3 equ 0xfed9
PWMA_CCR3H equ 0xfed9
PWMA_CCR3L equ 0xfeda
PWMA_CCR4 equ 0xfedb
PWMA_CCR4H equ 0xfedb
PWMA_CCR4L equ 0xfedc
PWMA_BKR equ 0xfedd
PWMA_DTR equ 0xfede
PWMA_OISR equ 0xfedf
PWMB_CR1 equ 0xfee0
PWMB_CR2 equ 0xfee1
PWMB_SMCR equ 0xfee2
PWMB_ETR equ 0xfee3
PWMB_IER equ 0xfee4
PWMB_SR1 equ 0xfee5
PWMB_SR2 equ 0xfee6
PWMB_EGR equ 0xfee7
PWMB_CCMR1 equ 0xfee8
PWMB_CCMR2 equ 0xfee9
PWMB_CCMR3 equ 0xfeea
PWMB_CCMR4 equ 0xfeeb
PWMB_CCER1 equ 0xfeec
PWMB_CCER2 equ 0xfeed
PWMB_CNTR equ 0xfeee
PWMB_CNTRH equ 0xfeee
PWMB_CNTRL equ 0xfeef
PWMB_PSCR equ 0xfef0
PWMB_PSCRH equ 0xfef0
PWMB_PSCRL equ 0xfef1
PWMB_ARR equ 0xfef2
PWMB_ARRH equ 0xfef2
PWMB_ARRL equ 0xfef3
PWMB_RCR equ 0xfef4
PWMB_CCR5 equ 0xfef5
PWMB_CCR5H equ 0xfef5
PWMB_CCR5L equ 0xfef6
PWMB_CCR6 equ 0xfef7
PWMB_CCR6H equ 0xfef7
PWMB_CCR6L equ 0xfef8
PWMB_CCR7 equ 0xfef9
PWMB_CCR7H equ 0xfef9
PWMB_CCR7L equ 0xfefa
PWMB_CCR8 equ 0xfefb
PWMB_CCR8H equ 0xfefb
PWMB_CCR8L equ 0xfefc
PWMB_BKR equ 0xfefd
PWMB_DTR equ 0xfefe
PWMB_OISR equ 0xfeff
P0INTE equ 0xfd00
P1INTE equ 0xfd01
P2INTE equ 0xfd02
P3INTE equ 0xfd03
P4INTE equ 0xfd04
P5INTE equ 0xfd05
P6INTE equ 0xfd06
P7INTE equ 0xfd07
P0INTF equ 0xfd10
P1INTF equ 0xfd11
P2INTF equ 0xfd12
P3INTF equ 0xfd13
P4INTF equ 0xfd14
P5INTF equ 0xfd15
P6INTF equ 0xfd16
P7INTF equ 0xfd17
P0IM0 equ 0xfd20
P1IM0 equ 0xfd21
P2IM0 equ 0xfd22
P3IM0 equ 0xfd23
P4IM0 equ 0xfd24
P5IM0 equ 0xfd25
P6IM0 equ 0xfd26
P7IM0 equ 0xfd27
P0IM1 equ 0xfd30
P1IM1 equ 0xfd31
P2IM1 equ 0xfd32
P3IM1 equ 0xfd33
P4IM1 equ 0xfd34
P5IM1 equ 0xfd35
P6IM1 equ 0xfd36
P7IM1 equ 0xfd37
P0WKUE equ 0xfd40
P1WKUE equ 0xfd41
P2WKUE equ 0xfd42
P3WKUE equ 0xfd43
P4WKUE equ 0xfd44
P5WKUE equ 0xfd45
P6WKUE equ 0xfd46
P7WKUE equ 0xfd47
PIN_IP equ 0xfd60
PIN_IPH equ 0xfd61
MD3 equ 0xfcf0
MD2 equ 0xfcf1
MD1 equ 0xfcf2
MD0 equ 0xfcf3
MD5 equ 0xfcf4
MD4 equ 0xfcf5
ARCON equ 0xfcf6
OPCON equ 0xfcf7
COMEN equ 0xfb00
SEGENL equ 0xfb01
SEGENH equ 0xfb02
LEDCTRL equ 0xfb03
LEDCKS equ 0xfb04
COM0_DA_L equ 0xfb10
COM1_DA_L equ 0xfb11
COM2_DA_L equ 0xfb12
COM3_DA_L equ 0xfb13
COM4_DA_L equ 0xfb14
COM5_DA_L equ 0xfb15
COM6_DA_L equ 0xfb16
COM7_DA_L equ 0xfb17
COM0_DA_H equ 0xfb18
COM1_DA_H equ 0xfb19
COM2_DA_H equ 0xfb1a
COM3_DA_H equ 0xfb1b
COM4_DA_H equ 0xfb1c
COM5_DA_H equ 0xfb1d
COM6_DA_H equ 0xfb1e
COM7_DA_H equ 0xfb1f
COM0_DC_L equ 0xfb20
COM1_DC_L equ 0xfb21
COM2_DC_L equ 0xfb22
COM3_DC_L equ 0xfb23
COM4_DC_L equ 0xfb24
COM5_DC_L equ 0xfb25
COM6_DC_L equ 0xfb26
COM7_DC_L equ 0xfb27
COM0_DC_H equ 0xfb28
COM1_DC_H equ 0xfb29
COM2_DC_H equ 0xfb2a
COM3_DC_H equ 0xfb2b
COM4_DC_H equ 0xfb2c
COM5_DC_H equ 0xfb2d
COM6_DC_H equ 0xfb2e
COM7_DC_H equ 0xfb2f
TSCHEN1 equ 0xfb40
TSCHEN2 equ 0xfb41
TSCFG1 equ 0xfb42
TSCFG2 equ 0xfb43
TSWUTC equ 0xfb44
TSCTRL equ 0xfb45
TSSTA1 equ 0xfb46
TSSTA2 equ 0xfb47
TSRT equ 0xfb48
TSDAT equ 0xfb49
TSDATH equ 0xfb49
TSDATL equ 0xfb4A
TSTH00 equ 0xfb50
TSTH00H equ 0xfb50
TSTH00L equ 0xfb51
TSTH01 equ 0xfb52
TSTH01H equ 0xfb52
TSTH01L equ 0xfb53
TSTH02 equ 0xfb54
TSTH02H equ 0xfb54
TSTH02L equ 0xfb55
TSTH03 equ 0xfb56
TSTH03H equ 0xfb56
TSTH03L equ 0xfb57
TSTH04 equ 0xfb58
TSTH04H equ 0xfb58
TSTH04L equ 0xfb59
TSTH05 equ 0xfb5a
TSTH05H equ 0xfb5a
TSTH05L equ 0xfb5b
TSTH06 equ 0xfb5c
TSTH06H equ 0xfb5c
TSTH06L equ 0xfb5d
TSTH07 equ 0xfb5e
TSTH07H equ 0xfb5e
TSTH07L equ 0xfb5f
TSTH08 equ 0xfb60
TSTH08H equ 0xfb60
TSTH08L equ 0xfb61
TSTH09 equ 0xfb62
TSTH09H equ 0xfb62
TSTH09L equ 0xfb63
TSTH10 equ 0xfb64
TSTH10H equ 0xfb64
TSTH10L equ 0xfb65
TSTH11 equ 0xfb66
TSTH11H equ 0xfb66
TSTH11L equ 0xfb67
TSTH12 equ 0xfb68
TSTH12H equ 0xfb68
TSTH12L equ 0xfb69
TSTH13 equ 0xfb6a
TSTH13H equ 0xfb6a
TSTH13L equ 0xfb6b
TSTH14 equ 0xfb6c
TSTH14H equ 0xfb6c
TSTH14L equ 0xfb6d
TSTH15 equ 0xfb6e
TSTH15H equ 0xfb6e
TSTH15L equ 0xfb6f
DMA_ADC_CFG equ 0xfa10
DMA_ADC_CR equ 0xfa11
DMA_ADC_STA equ 0xfa12
DMA_ADC_RXA equ 0xfa17
DMA_ADC_RXAH equ 0xfa17
DMA_ADC_RXAL equ 0xfa18
DMA_ADC_CFG2 equ 0xfa19
DMA_ADC_CHSW0 equ 0xfa1a
DMA_ADC_CHSW1 equ 0xfa1b
DMA_SPI_CFG equ 0xfa20
DMA_SPI_CR equ 0xfa21
DMA_SPI_STA equ 0xfa22
DMA_SPI_AMT equ 0xfa23
DMA_SPI_DONE equ 0xfa24
DMA_SPI_TXA equ 0xfa25
DMA_SPI_TXAH equ 0xfa25
DMA_SPI_TXAL equ 0xfa26
DMA_SPI_RXA equ 0xfa27
DMA_SPI_RXAH equ 0xfa27
DMA_SPI_RXAL equ 0xfa28
DMA_SPI_CFG2 equ 0xfa29
DMA_UR1T_CFG equ 0xfa30
DMA_UR1T_CR equ 0xfa31
DMA_UR1T_STA equ 0xfa32
DMA_UR1T_AMT equ 0xfa33
DMA_UR1T_DONE equ 0xfa34
DMA_UR1T_TXA equ 0xfa35
DMA_UR1T_TXAH equ 0xfa35
DMA_UR1T_TXAL equ 0xfa36
DMA_UR1R_CFG equ 0xfa38
DMA_UR1R_CR equ 0xfa39
DMA_UR1R_STA equ 0xfa3a
DMA_UR1R_AMT equ 0xfa3b
DMA_UR1R_DONE equ 0xfa3c
DMA_UR1R_RXA equ 0xfa3d
DMA_UR1R_RXAH equ 0xfa3d
DMA_UR1R_RXAL equ 0xfa3e
DMA_UR2T_CFG equ 0xfa40
DMA_UR2T_CR equ 0xfa41
DMA_UR2T_STA equ 0xfa42
DMA_UR2T_AMT equ 0xfa43
DMA_UR2T_DONE equ 0xfa44
DMA_UR2T_TXA equ 0xfa45
DMA_UR2T_TXAH equ 0xfa45
DMA_UR2T_TXAL equ 0xfa46
DMA_UR2R_CFG equ 0xfa48
DMA_UR2R_CR equ 0xfa49
DMA_UR2R_STA equ 0xfa4a
DMA_UR2R_AMT equ 0xfa4b
DMA_UR2R_DONE equ 0xfa4c
DMA_UR2R_RXA equ 0xfa4d
DMA_UR2R_RXAH equ 0xfa4d
DMA_UR2R_RXAL equ 0xfa4e
DMA_UR3T_CFG equ 0xfa50
DMA_UR3T_CR equ 0xfa51
DMA_UR3T_STA equ 0xfa52
DMA_UR3T_AMT equ 0xfa53
DMA_UR3T_DONE equ 0xfa54
DMA_UR3T_TXA equ 0xfa55
DMA_UR3T_TXAH equ 0xfa55
DMA_UR3T_TXAL equ 0xfa56
DMA_UR3R_CFG equ 0xfa58
DMA_UR3R_CR equ 0xfa59
DMA_UR3R_STA equ 0xfa5a
DMA_UR3R_AMT equ 0xfa5b
DMA_UR3R_DONE equ 0xfa5c
DMA_UR3R_RXA equ 0xfa5d
DMA_UR3R_RXAH equ 0xfa5d
DMA_UR3R_RXAL equ 0xfa5e
DMA_UR4T_CFG equ 0xfa60
DMA_UR4T_CR equ 0xfa61
DMA_UR4T_STA equ 0xfa62
DMA_UR4T_AMT equ 0xfa63
DMA_UR4T_DONE equ 0xfa64
DMA_UR4T_TXA equ 0xfa65
DMA_UR4T_TXAH equ 0xfa65
DMA_UR4T_TXAL equ 0xfa66
DMA_UR4R_CFG equ 0xfa68
DMA_UR4R_CR equ 0xfa69
DMA_UR4R_STA equ 0xfa6a
DMA_UR4R_AMT equ 0xfa6b
DMA_UR4R_DONE equ 0xfa6c
DMA_UR4R_RXA equ 0xfa6d
DMA_UR4R_RXAH equ 0xfa6d
DMA_UR4R_RXAL equ 0xfa6e
DMA_LCM_CFG equ 0xfa70
DMA_LCM_CR equ 0xfa71
DMA_LCM_STA equ 0xfa72
DMA_LCM_AMT equ 0xfa73
DMA_LCM_DONE equ 0xfa74
DMA_LCM_TXA equ 0xfa75
DMA_LCM_TXAH equ 0xfa75
DMA_LCM_TXAL equ 0xfa76
DMA_LCM_RXA equ 0xfa77
DMA_LCM_RXAH equ 0xfa77
DMA_LCM_RXAL equ 0xfa78
